/******************************************************************************* 
******************************************************************************** 
* 文件名称: isr.c
*
* 描    述: 中断处理程序例程
* 
* 
* 作    者: 秦战强
* 日    期: 2016/12/29
******************************************************************************** 
*******************************************************************************/ 




#include "common.h"
#include "include.h"


/******************************************************************************* 
******************************************************************************** 
* 函数名称: xxx_ISRHandler()
* 
* 功    能: 任务调度使用中断的方法 
* 
* 作    者: 秦战强
* 日    期: 2016/12/29
******************************************************************************** 
*******************************************************************************/ 
void xxx_IRQHandler(void) 
{  
   OSIntEnter();                                //通知系统进入中断服务程序
   
   //put your code here
   
   OSIntExit();                                 //通知系统退出中断服务程序
} 




/*************************************************************************
 *                             武汉理工大学秦战强
 *
 *  函数名称：USART0_IRQHandler
 *  功能说明：USART0中断服务程序
              
 *  参数说明：无
 *  函数返回：无
 *  作    者：秦战强
 *  修改时间：2016/12/29   
 *  
 *************************************************************************/
 void USART0_IRQHandler()
 {
   OSIntEnter();                                //通知系统进入中断服务程序
   
   //put your code here
   
   OSIntExit();                                 //通知系统退出中断服务程序   
 }

/*************************************************************************
*                             武汉理工大学秦战强
*
*  函数名称：USART1_IRQHandler
*  功能说明：USART1中断服务程序
             
*  参数说明：无
*  函数返回：无
*  作    者：秦战强
*  修改时间：2016/12/29   
*  
*************************************************************************/
void USART1_IRQHandler()
{
   OSIntEnter();                                //通知系统进入中断服务程序
   
   //put your code here
   
   OSIntExit();                                 //通知系统退出中断服务程序
}
/*************************************************************************
*                             武汉理工大学秦战强
*
*  函数名称：USART2_IRQHandler
*  功能说明：USART2中断服务程序
             
*  参数说明：无
*  函数返回：无
*  作    者：秦战强
*  修改时间：2016/12/29   
*  
*************************************************************************/
void USART2_IRQHandler()
{
   OSIntEnter();                                //通知系统进入中断服务程序
   
   //put your code here
   
   OSIntExit();                                 //通知系统退出中断服务程序  
}
/*************************************************************************
*                             武汉理工大学秦战强
*
*  函数名称：USART3_IRQHandler
*  功能说明：USART3中断服务程序
             
*  参数说明：无
*  函数返回：无
*  作    者：秦战强
*  修改时间：2016/12/29   
*  
*************************************************************************/
void USART3_IRQHandler()
{
   OSIntEnter();                                //通知系统进入中断服务程序
   
   //put your code here
   
   OSIntExit();                                 //通知系统退出中断服务程序  
}
/*************************************************************************
*                             武汉理工大学秦战强
*
*  函数名称：USART4_IRQHandler
*  功能说明：USART4中断服务程序
            
*  参数说明：无
*  函数返回：无
*  作    者：秦战强
*  修改时间：2016/12/29   
*  
*************************************************************************/
void USART4_IRQHandler()
{
  OSIntEnter();                                //通知系统进入中断服务程序
 
 //put your code here
 
  OSIntExit();                                 //通知系统退出中断服务程序   
}
/*************************************************************************
*                             武汉理工大学秦战强
*
*  函数名称：USART5_IRQHandler
*  功能说明：USART5中断服务程序
             
*  参数说明：无
*  函数返回：无
*  作    者：秦战强
*  修改时间：2016/12/29   
*  
*************************************************************************/
void USART5_IRQHandler()
{
  OSIntEnter();                                //通知系统进入中断服务程序
 
  //put your code here
 
  OSIntExit(); 
}







/*************************************************************************
*                             武汉理工大学秦战强
*
*  函数名称：PIT0_IRQHandler
*  功能说明：PIT0中断服务程序
             
*  参数说明：无
*  函数返回：无
*  作    者：秦战强
*  修改时间：2016/12/29   
*  
*************************************************************************/
void PIT0_IRQHandler(void)
{
#if 1
   LED_turn(LED1);             //LED1反转
   PIT_Flag_Clear(PIT0);       //清中断标志位
#else
extern u32 test_time;
void PIT0_IRQHandler(void)
{
    test_time++;
    PIT_Flag_Clear(PIT0);       //清中断标志位
}
#endif
}


/*************************************************************************
*                             武汉理工大学秦战强
*
*  函数名称：PIT1_IRQHandler
*  功能说明：PIT1中断服务程序
             
*  参数说明：无
*  函数返回：无
*  作    者：秦战强
*  修改时间：2016/12/29   
*  
*************************************************************************/
void PIT1_IRQHandler()
{
  OSIntEnter();                                //通知系统进入中断服务程序
 
  //put your code here
 
  OSIntExit(); 
}
/*************************************************************************
*                             武汉理工大学秦战强
*
*  函数名称：PIT2_IRQHandler
*  功能说明：PIT2中断服务程序
             
*  参数说明：无
*  函数返回：无
*  作    者：秦战强
*  修改时间：2016/12/29   
*  
*************************************************************************/
void PIT2_IRQHandler()
{
  OSIntEnter();                                //通知系统进入中断服务程序
 
  //put your code here
 
  OSIntExit(); 
}
/*************************************************************************
*                             武汉理工大学秦战强
*
*  函数名称：PIT3_IRQHandler
*  功能说明：PIT3中断服务程序
             
*  参数说明：无
*  函数返回：无
*  作    者：秦战强
*  修改时间：2016/12/29   
*  
*************************************************************************/
void PIT3_IRQHandler()
{
  OSIntEnter();                                //通知系统进入中断服务程序
 
  //put your code here
 
  OSIntExit(); 
}



/*************************************************************************
*                             武汉理工大学秦战强
*
*  函数名称：SysTick_Handler
*  功能说明：系统滴答定时器中断服务函数
*  参数说明：无
*  函数返回：无
*  修改时间：2012-2-18    已测试
*  备    注：ucos里用得到
*************************************************************************/
void SysTick_Handler(void)
{
        OSIntEnter();                                   //进入中断服务程序，记录中断嵌套层数
        
        OSTimeTick();                                   //调用节拍处理函数
        
        OSIntExit();                                    //退出中断服务程序，中断嵌套层数减一
}


/*************************************************************************
*                             武汉理工大学秦战强
*
*  函数名称：HardFault_Handler
*  功能说明：硬件上访中断服务函数
*  参数说明：无
*  函数返回：无
*  修改时间：2012-2-4    已测试
*  备    注：可以用LED闪烁来指示发生了硬件上访
*************************************************************************/
void HardFault_Handler(void)
{
  OSIntEnter();                                //通知系统进入中断服务程序
 
  //put your code here
 
  OSIntExit();  
}

/*************************************************************************
*                             武汉理工大学秦战强
*
*  函数名称：PendSV_Handler
*  功能说明：PendSV（可悬起系统调用）中断服务函数
*  参数说明：无
*  函数返回：无
*  修改时间：2012-2-15    已测试
*  备    注：uC/OS用来切换任务
*************************************************************************/
void PendSV_Handler(void)
{
  OSIntEnter();                                //通知系统进入中断服务程序
 
  //put your code here
 
  OSIntExit(); 
}

/*************************************************************************
*                             武汉理工大学秦战强
*
*  函数名称：PORTA_IRQHandler
*  功能说明：PORTA中断服务程序
*  参数说明：无
*  函数返回：无
*  作    者：秦战强
*  修改时间：2016/12/29   
*  
*************************************************************************/

void PORTA_IRQHandler()
{
  OSIntEnter();                                //通知系统进入中断服务程序
 
  //put your code here
 
  OSIntExit(); 
}
/*************************************************************************
*                             武汉理工大学秦战强
*
*  函数名称：PORTB_IRQHandler
*  功能说明：PORTB中断服务程序
*  参数说明：无
*  函数返回：无
*  作    者：秦战强
*  修改时间：2016/12/29   
*  
*************************************************************************/
void PORTB_IRQHandler()
{
  OSIntEnter();                                //通知系统进入中断服务程序
 
  //put your code here
 
  OSIntExit(); 
}

/*************************************************************************
*                             武汉理工大学秦战强
*
*  函数名称：PORTC_IRQHandler
*  功能说明：PORTC中断服务程序
*  参数说明：无
*  函数返回：无
*  作    者：秦战强
*  修改时间：2016/12/29   
*  
*************************************************************************/
void PORTC_IRQHandler()
{
  OSIntEnter();                                //通知系统进入中断服务程序
 
  //put your code here
 
  OSIntExit(); 
}
/*************************************************************************
*                             武汉理工大学秦战强
*
*  函数名称：PORTD_IRQHandler
*  功能说明：PORTD中断服务程序
             
*  参数说明：无
*  函数返回：无
*  作    者：秦战强
*  修改时间：2016/12/29   
*  
*************************************************************************/
void PORTD_IRQHandler()
{
  OSIntEnter();                                //通知系统进入中断服务程序
 
 //put your code here
 
  OSIntExit(); 
}
/*************************************************************************
*                             武汉理工大学秦战强
*
*  函数名称：PORTE_IRQHandler
*  功能说明：PORTE中断服务程序
            
*  参数说明：无
*  函数返回：无
*  作    者：秦战强
*  修改时间：2016/12/29   
*  
*************************************************************************/
void PORTE_IRQHandler()
{
  OSIntEnter();                                //通知系统进入中断服务程序
 
 //put your code here
 
  OSIntExit(); 
}



/*************************************************************************
*                             武汉理工大学秦战强
*
*  函数名称：FTM0_IRQHandler
*  功能说明：FTM0输入捕捉中断服务函数
*  参数说明：无
*  函数返回：无
*  修改时间：2012-2-25
*  备    注：引脚号需要根据自己初始化来修改，参考现有的代码添加自己的功能
*************************************************************************/
void FTM0_IRQHandler()
{
  OSIntEnter();                                //通知系统进入中断服务程序
 
  //put your code here
 
  OSIntExit(); 

}

/*************************************************************************
*                             武汉理工大学秦战强
*
*  函数名称：FTM1_IRQHandler
*  功能说明：FTM1输入捕捉中断服务函数
*  参数说明：无
*  函数返回：无
*  修改时间：2012-2-25
*  备    注：引脚号需要根据自己初始化来修改，参考现有的代码添加自己的功能
*************************************************************************/
void FTM1_IRQHandler()
{
  OSIntEnter();                                //通知系统进入中断服务程序
 
  //put your code here
 
  OSIntExit();   
}



